export const questions = [
  {
    title: "React - это ... ?",
    variants: ["библиотека", "фреймворк", "приложение"],
    correct: 0,
  },
  {
    title: "Компонент - это ... ",
    variants: [
      "приложение",
      "часть приложения или страницы",
      "то, что я не знаю что такое",
    ],
    correct: 1,
  },
  {
    title: "Что такое JSX?",
    variants: [
      "Это простой HTML",
      "Это функция",
      "Это тот же HTML, но с возможностью выполнять JS-код",
    ],
    correct: 2,
  },
  {
    title: "Что такое Virtual DOM в React?",
    variants: [
      "Виртуальное представление структуры документа в React",
      "Виртуальный сервер для хранения данных",
      "Механизм оптимизации для улучшения производительности рендеринга в React",
    ],
    correct: 2,
  },
  {
    title: "Что такое хуки (hooks) в React?",
    variants: [
      "Инструмент для удержания куртки",
      "Функциональные компоненты в React",
      "Новый механизм, позволяющий использовать состояние и другие возможности React без написания классов",
    ],
    correct: 2,
  },
  {
    title: "Что такое компоненты высшего порядка (HOC) в React?",
    variants: [
      "Компоненты, которые находятся выше в иерархии дерева React",
      "Специальные компоненты, которые используются для создания анимаций",
      "Функции, которые принимают компоненты в качестве аргумента и возвращают новые компоненты",
    ],
    correct: 2,
  },
  {
    title: "Что такое контекст (context) в React?",
    variants: [
      "Способ передачи данных через иерархию компонентов без необходимости передачи пропсов вручную на каждом уровне",
      "Функция для создания анимаций в React",
      "Механизм для управления состоянием в функциональных компонентах",
    ],
    correct: 0,
  },
  {
    title: "Что такое порталы (portals) в React?",
    variants: [
      "Способ перемещения элементов из DOM вне иерархии компонентов React",
      "Специальные элементы для реализации анимаций",
      "Функции для создания плагинов в React",
    ],
    correct: 0,
  },
  {
    title: "Что такое reconciliation в React?",
    variants: [
      "Процесс сопоставления виртуального DOM с реальным DOM для определения изменений",
      "Процесс оптимизации виртуального DOM для повышения производительности",
      "Процесс применения изменений из виртуального DOM в реальный DOM",
    ],
    correct: 0,
  },
  {
    title: "Что такое серверный рендеринг (SSR) в React?",
    variants: [
      "Процесс рендеринга React-компонентов на стороне клиента",
      "Процесс рендеринга React-компонентов на сервере с последующей отправкой готовой HTML-страницы на клиент",
      "Процесс кэширования HTML-страниц на сервере для улучшения производительности",
    ],
    correct: 1,
  },
];
